[
  {
    "parkCode": "acad",
    "visitedOn": ["2017-08-13"],
    "notes": "Picked a good handful of blueberries after hiking to the top of the beehive trail. Hiked Cadillac Mountain in reverse: parking at the top, then hiking across to Dorr Mountain and back."
  },
  {
    "parkCode": "this",
    "visitedOn": ["2018-08-13"]
  },
  {
    "parkCode": "boha",
    "visitedOn": ["2018-10-20", "2022-09-03"],
    "notes": "Collected a variety of sea glass from Spectacle Island."
  },
  {
    "parkCode": "muwo",
    "visitedOn": ["2019-06-19"],
    "notes": "Hiked the Dipsea Trail to the Ben Johnson Trail to the Hillside trail, ending in Cathedral Grove. Despite full parking lots, we encountered almost no other hikers until arriving back at the paved section through the grove."
  },
  {
    "parkCode": "saga",
    "visitedOn": ["2019-10-29"],
    "notes": "Visited on our way back from vacation in Vermont. Notable statues were the Standing Lincoln and a cast of the Massachusetts 54th Regiment Memorial. Flushed a woodcock while walking through the garden."
  },
  {
    "parkCode": "mima",
    "visitedOn": ["2020-03-21", "2022-08-15"],
    "notes": "Walked the length of Battle Road."
  },
  {
    "parkCode": "caco",
    "visitedOn": ["2020-12-12", "2021-11-16", "2022-12-05"],
    "notes": "Visited and transmitted from the Marconi wireless station. Collected a good amount of driftwood, which was boiled and is now in aquariums."
  },
  {
    "parkCode": "nebe",
    "visitedOn": ["2022-07-23"],
    "notes": "Favorite Fact: The last whaling ship left New Bedford harbor in 1925."
  },
  {
    "parkCode": "wefa",
    "visitedOn": ["2022-07-31"],
    "notes": "There were a number of interesting items from the Weir family on display in their home, including a taxidermied Cooper's Hawk."
  },
  {
    "parkCode": "long",
    "visitedOn": ["2022-08-05"],
    "notes": "Favorite Fact: The property was purchased by Nathaniel Appleton as a gift to his daughter and son-in-law, Henry Wadsworth Longfellow. The Appleton family also owned the mill factories that grew into the city of Lowell."
  },
  {
    "parkCode": "frla",
    "visitedOn": ["2022-08-07"],
    "notes": "Favorite Feature: The drafting rooms on the top floor of the house contained a number of tools for the creation of blueprints, including drafting tables on tracks that could be pushed outdoors to expose in the sun, a floor-to-ceiling glass cylinder lit from the center around which blueprints could be wrapped, and a closet that was retrofitted as an arsenic gas chamber for exposing blueprints chemically."
  },
  {
    "parkCode": "blrv",
    "visitedOn": ["2022-08-13"],
    "notes": "Visited Slater Mill, the site of the first water-powered textile mill in the United States."
  },
  {
    "parkCode": "rowi",
    "visitedOn": ["2022-08-13"],
    "notes": "Located in the center of Providence, the memorial is located directly across the street from Roger Williams house. He settled in this location due to the proximity to an active freshwater spring. The spring is located within the memorial."
  },
  {
    "parkCode": "lowe",
    "visitedOn": ["2022-08-15"],
    "notes": "Favorite Fact: The factories of the city were operated by a series of canals that are almost six miles long. This remains the largest series of power canals in the United States."
  },
  {
    "parkCode": "sair",
    "visitedOn": ["2022-08-19"],
    "notes": "Favorite Fact: The site was rediscovered and excavated by Roland W. Robbins, an amateur archeologist. Robbins is also responsible for discovering the foundation of Thoreau's house at Walden Pond, as well as John Alden's home in Duxbury."
  },
  {
    "parkCode": "sama",
    "visitedOn": ["2022-08-19"],
    "notes": "Favorite Fact: The Salem Maritime NHP was the first National Historic Site established by the Park Service."
  },
  {
    "parkCode": "bost",
    "visitedOn": ["2022-09-03"],
    "notes": "Visited all sites, starting with a climb to the top of the Bunker Hill Monument, then the USS Constitution and USS Casin Young at the Charlestown Navy Yard, ending at Faneuil Hall. Favorite Fact: The construction of Dry Dock 1 at the Navy yard in 1833, along with the construction of a second dry dock in Norfolk, VA, was the largest civil works project undertaken by the United States at the time."
  },
  { "parkCode": "boaf", "visitedOn": ["2022-09-03"] },
  {
    "parkCode": "liho",
    "visitedOn": ["2022-10-16"],
    "notes": "Favorite Feature: Lincoln's bedroom contains his original writing desk, which was very plain and small. It held sentimental value for him as he had purchased the desk early in his career, so he kept and used it long after he could have afforded a more ornate desk, to the chagrin of Mary Todd."
  },
  {
    "parkCode": "pull",
    "visitedOn": ["2022-10-17"],
    "notes": "The museum featured a replica of a Pullman sleeper car, including a bed that folded down from the overhead compartment."
  },
  {
    "parkCode": "jeff",
    "visitedOn": ["2022-10-16"],
    "notes": "Favorite Feature: The entrance to each tram car is only 4.5 feet tall! Such small trams are necessary due to the arch narrowing to less than 7 feet at the top. The tram cars also rotate 155 degrees over the course of the ride in order to keep passengers upright."
  },
  {
    "parkCode": "stge",
    "visitedOn": ["2022-10-15"],
    "notes": "Favorite Fact: The earliest settlers of Ste. Genevieve began farming in the fertile soil along the Missippi River before establishing a permanent settlement. They would travel to the fields in the spring to plant crops and return only in the fall to harvest."
  },
  {
    "parkCode": "ulsg",
    "visitedOn": ["2022-10-15"],
    "notes": "Favorite Fact: Grant's residence, Whitehaven, was painted a shade of green known as Paris Green. The color was so named as it contained arsenic and was once used to kill rats in the sewers of Paris. Interestingly, there is also a green dress in the Lincoln home that requires special care when being handled since it also contains traces of arsenic."
  },
  { "parkCode": "lecl", "visitedOn": ["2022-10-16"] },
  {
    "parkCode": "spar",
    "visitedOn": ["2022-10-30"],
    "notes": "The museum has a display of government issued firearms that suffered unusual damage, icluding lightning strikes and barrels split by oncoming bullets."
  },
  {
    "parkCode": "feha",
    "visitedOn": ["2022-11-14"],
    "notes": "Federal Hall was the site of many historic moments including the Zenger trial (helping to establish freedom of the press), authoring of the Bill of Rights, and the inauguration of George Washington. "
  },
  { "parkCode": "ston", "visitedOn": ["2022-11-14"] },
  {
    "parkCode": "elis",
    "visitedOn": ["2022-11-18"],
    "notes": "The Ellis Island Museum was the most extensive NPS museum we have visited. The exhibits of the screening process and family heirlooms were of particular interest."
  },
  {
    "parkCode": "stli",
    "visitedOn": ["2022-11-18"],
    "notes": "Favorite Fact: The copper sheeting that makes up the Statue of Liberty's form is only as thick as only two pennies!"
  },
  {
    "parkCode": "cacl",
    "visitedOn": ["2022-11-18"],
    "notes": "Favorite Fact: Castle Clinton was the location of the New York Aquarium from 1896 to 1941."
  },
  {
    "parkCode": "afbg",
    "visitedOn": ["2022-11-18"],
    "notes": "The 419 skeletal remains (average age of 22 years old) uncovered during the construction of a federal building were reinterred at the memorial site."
  },
  { "parkCode": "npnh", "visitedOn": ["2022-11-18"] },
  {
    "parkCode": "sahi",
    "visitedOn": ["2023-02-18"],
    "notes": "The uniforms Theodore Roosevelt wore while serving as a Colonel in the Rough Riders were tailored by Brooks Brothers."
  },
  {
    "parkCode": "fiis",
    "visitedOn": ["2023-02-18"],
    "notes": "The Fire Island lighthouse was originally constructed at the west end of the island, but is currently more than 5 miles east of the island's end, due to the island's growth from littoral drift."
  },
  {
    "parkCode": "hofr",
    "visitedOn": ["2023-02-19"],
    "notes": "The foyer of FDR's house was decorated as it was when he lived in the home. It contained a glass display case containing songbirds and birds of prey that Roosevelt shot and taxidermied as a child."
  },
  {
    "parkCode": "vama",
    "visitedOn": ["2023-02-19"],
    "notes": "While the mansion cost $660,000 to build and $1.5 million to furnish, no buyers were willing to purchase the property for more than a few hundred thousand dollars during the Great Depression. As a result, the property was donated to the Park Service in exchange for a significant tax deduction instead."
  },
  {
    "parkCode": "elro",
    "visitedOn": ["2023-02-19"],
    "notes": "Eleanor Roosevelt moved to this property after the death of FDR."
  }
]
